const arr = ['JW-32-173802(翻單)',
  'J-JW-44-121505-01（國際單）',
  'J-JW-44-222502-01（國際單）',
  'J-JW-44-122504-01（國際單）',
  'J-JW-44-159535-01（國際單）',
  'J-JW-44-123516-01（國際單）']

// 去除前缀和后缀，只保留中间的JW-44-123516-01这一段的数字

const result = arr.map((item) => {
  return item.match(/JW-44-(\d{6}-\d{2})/)
})

result.forEach((item) => {
  if (item)
    console.log(item[0])
})
const data1 = [
  'A-JJ-32-573801-51', 'A-JW-32-173801-52', 'A-JW-32-173802-52', 'A-JW-44-151889-51',
  'A-JW-44-171508-51', 'A-JW-44-171521-51', 'A-JW-44-181861-51', 'A-JW-44-181862-51',
  'A-JW-44-222520-51', 'A-JW-44-271522-51', 'A-JW-44-271523-51', 'A-JW-44-281861-51',
  'A-JW-44-281862-51',
]

const data2 = [
  'A-JJ-32-573801-51', 'A-JW-32-173801-52', 'A-JW-32-173802-52', 'A-JW-44-121505-51',
  'A-JW-44-122504-51', 'A-JW-44-123516-51', 'A-JW-44-151889-51', 'A-JW-44-159535-51',
  'A-JW-44-171508-51', 'A-JW-44-171521-51', 'A-JW-44-181861-51', 'A-JW-44-181862-51',
  'A-JW-44-222502-51', 'A-JW-44-222520-51', 'A-JW-44-271522-51', 'A-JW-44-271523-51',
  'A-JW-44-281861-51', 'A-JW-44-281862-51', 'J-JW-44-121505-01', 'J-JW-44-122504-01',
  'J-JW-44-123516-01', 'J-JW-44-159535-01', 'J-JW-44-222502-01',
]

const set1 = new Set(data1)
const set2 = new Set(data2)

const diff1 = [...set1].filter(x => !set2.has(x))
const diff2 = [...set2].filter(x => !set1.has(x))

console.log('第一组数据中有但第二组数据中没有的项：', diff1)
console.log('第二组数据中有但第一组数据中没有的项：', diff2)
